import React from "react";
import WelcomeHeader from "@/components/popups/WelcomeHeader";
import LectureGrid from "@/components/popups/LectureDisplay";

export default function Popup(): JSX.Element {
  return (
    <div className="p-6 w-3/6 h-[100vh] flex flex-col-reverse">
      <div className="w-full">
        <WelcomeHeader />
      </div>

      <div className="w-full h-3/4 pb-6">
        <LectureGrid
          content={[
            {
              id: 1,
              lecture_id: 101,
              type: "video",
              page_content: [
                {
                  subtitle: "Сите ние сме експерти - Управување со личен буџет",
                  text: "Евиденцијата на приходите и на расходите претставува основа за управување со финансии и домаќинство. Водењето на буџетот ни овозможува да ја согледаме реалната состојба на своите финансии и да ги распределиме парите што ги имаме во согласност со приоритетите.",
                  image: "/images/previewPopup/lecture_page1_sprite.svg",
                },
                {
                  subtitle: "Формирање на буџетот  - „Дали навистина морам да се занимавам и со ова?“",
                  text: "На прв поглед, управување со финансии звучи како нешто страшно комплицирано, нешто со што се занимаваат само економистите со очила во безбројни и безбојни катови на деловни згради. Приближно, како нешто за што ќе помислите – „фала му на Бога што не морам да се занимавам со тоа во мојот живот!“, па одите да купите пица по часови или по работа, затоа што навистина сте ја заслужиле – иако дома го имате ручекот од вчера.Управувањето со финансиите во најширока смисла и е работа на економист. Меѓутоа, еден мал збор го менува и во вашата работа – и тој е исклучително важен: лично.",
                },
                {
                    text: "Значи, управувањето со личните финансии е, сепак, наша задача!",
                    align_right: true,
                },
                {
                  subtitle: "Најосновната причина за правење буџет е тоа што има многу трошоци и расходи на секој чекор, а нашите приходи тоа не можат секогаш да го следат.",
                  color: "customOrange",
                },
              ],
              order: 1,
            },
            {
              id: 2,
              lecture_id: 101,
              type: "text",
              page_content: [
                {
                  subtitle: "Сите ние сме експерти - Управување со личен буџет",
                  text: "Евиденцијата на приходите и на расходите претставува основа за управување со финансии и домаќинство. Водењето на буџетот ни овозможува да ја согледаме реалната состојба на своите финансии и да ги распределиме парите што ги имаме во согласност со приоритетите.",
                  image: "/images/previewPopup/lecture_page1_sprite.svg",
                },
                {
                  subtitle: "Формирање на буџетот  - „Дали навистина морам да се занимавам и со ова?“",
                  text: "На прв поглед, управување со финансии звучи како нешто страшно комплицирано, нешто со што се занимаваат само економистите со очила во безбројни и безбојни катови на деловни згради. Приближно, како нешто за што ќе помислите – „фала му на Бога што не морам да се занимавам со тоа во мојот живот!“, па одите да купите пица по часови или по работа, затоа што навистина сте ја заслужиле – иако дома го имате ручекот од вчера.Управувањето со финансиите во најширока смисла и е работа на економист. Меѓутоа, еден мал збор го менува и во вашата работа – и тој е исклучително важен: лично.",
                },
              ],
              order: 2,
            },
            {
              id: 3,
              lecture_id: 101,
              type: "quiz",
              order: 3,
              page_content: [
                {
                    text: "Значи, управувањето со личните финансии е, сепак, наша задача!",
                    align_right: true,
                },
                {
                  subtitle: "Најосновната причина за правење буџет е тоа што има многу трошоци и расходи на секој чекор, а нашите приходи тоа не можат секогаш да го следат.",
                  color: "customOrange",
                },
              ],
            },
          ]}
        />
      </div>
    </div>
  );
}
